In [1]:
import os
os.chdir('/home/roberto/Documents/Titulación/Tesina')
from scripts import *

### Países disponibles:

##### -España
##### -Alemania

### Años disponibles:

##### 2008 a 2017
### Métodos disponibles

correr_simulacion() para ejecutar simulación de nuevo

leer() leer como DataFrame la salida de la simulación

area_elegible(country, includer) para mapa cuadriculado del área a utilizar para paneles (Includer disponibles = dump y water)

tres_random(pais) para gráfica de tres días aleatorios de generación de energía

anual_country(pais) Generación anual por país. Regresa DF

suma_mes(country,mes) Regresa la producción total de un mes para cada año en un país (Regresa diccionario)

graficas_bienestar(country) Diagrama de caja y brazos para un país

produccion_por_mes(country) Producción por mes. Regresa la media y su estimación con intervalos de confianza al 95% (DataFrame)

ventas_spain() Regresa DataFrame con las ventas por cada mes de España

ventas_germany() Regresa DataFrame con las ventas por cada mes de Alemania

graficas_cuatrimestre(country) Gráficas por cuatrimestre. Perc.0.75, median y perc. 0.25

In [4]:
df = leer()
df[:24]

                        Spain   Germany
time
2008-01-01 00:00:00  0.000000  0.000000
2008-01-01 01:00:00  0.000000  0.000000
2008-01-01 02:00:00  0.000000  0.000000
2008-01-01 03:00:00  0.000000  0.000000
2008-01-01 04:00:00  0.000000  0.000000
2008-01-01 05:00:00  0.000000  0.000000
2008-01-01 06:00:00  0.000000  0.000000
2008-01-01 07:00:00  0.000000  0.000000
2008-01-01 08:00:00  0.005370  0.007675
2008-01-01 09:00:00  0.217544  0.060315
2008-01-01 10:00:00  0.439679  0.137610
2008-01-01 11:00:00  0.616812  0.218404
2008-01-01 12:00:00  0.706713  0.241595
2008-01-01 13:00:00  0.746167  0.240416
2008-01-01 14:00:00  0.671611  0.150428
2008-01-01 15:00:00  0.548661  0.076563
2008-01-01 16:00:00  0.330069  0.000567
2008-01-01 17:00:00  0.106445  0.000000
2008-01-01 18:00:00  0.000000  0.000000
2008-01-01 19:00:00  0.000000  0.000000
2008-01-01 20:00:00  0.000000  0.000000
2008-01-01 21:00:00  0.000000  0.000000
2008-01-01 22:00:00  0.000000  0.000000
2008-01-01 23:00:00  0.000000  0.000000

In [3]:
ventas_spain()

          Precios (Euros/MWh) Produccion [GWh]  Ventas (Euros)
January                €48.21       118.824411   €5,728,524.85
February               €42.61       134.036667   €5,711,302.37
March                  €35.03       180.477737   €6,322,135.14
April                  €27.38       192.118765   €5,260,211.78
May                    €28.98       208.482249   €6,041,815.57
June                   €37.54       207.848842   €7,802,645.52
July                   €41.10       220.886161   €9,078,421.20
August                 €43.12       212.815911   €9,176,622.10
September              €49.30       181.239021   €8,935,083.73
October                €44.63       157.986702   €7,050,946.52
November               €50.23       119.015089   €5,978,127.94
December               €50.16       111.898281   €5,612,817.79
Annual                                          €82,698,654.51